# Используем официальный образ Go версии 1.22.2
FROM golang:1.22.2-alpine AS builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем исходный код в контейнер
COPY . .

# Скачиваем зависимости
RUN go mod download

# Собираем приложение
RUN go build -o todo-app ./cmd/main.go

# Второй этап: создаем легковесный образ для запуска
FROM alpine:latest

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем собранное приложение из первого этапа
COPY --from=builder /app/todo-app .

# Открываем порт, на котором будет работать приложение
EXPOSE 8080

# Команда для запуска приложения
CMD ["./todo-app"]